# Interval Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
AlignmentStationLabelSetOptions..::..Interval Property
AlignmentStationLabelSetOptions Class See Also
---
The interval between labels to be created in the set, in Revit internal model units (standard Imperial feet). The default value is null. When null, a predefined interval value will be used, depending on the unit setting for stationing units in the document. For standard imperial, the default is 100 ft. For survey imperial, the default is 100 USft (US survey). For metric, the default is 1000 m.
**Namespace:** Autodesk.Revit.DB.Infrastructure**Assembly:** Autodesk.CivilAlignments.DBApplication (in Autodesk.CivilAlignments.DBApplication.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021.1
# Syntax
C#
---
```text
public Nullable<double> Interval { get; set; }
```

Visual Basic
---
```text
Public Property Interval As Nullable(Of Double)
	Get
	Set
```

Visual C++
---
```text
public:
property Nullable<double> Interval {
	Nullable<double> get ();
	void set (Nullable<double> value);
}
```

# See Also
AlignmentStationLabelSetOptions Class
Autodesk.Revit.DB.Infrastructure Namespace